Model: "sequential"
_________________________________________________________________
 Layer (type)                Output Shape              Param #   
=================================================================
 conv3d_1 (Conv3D)           (None, 8, 28, 28, 28)     3008      
                                                                 
 conv3d_2 (Conv3D)           (None, 16, 24, 24, 24)    16016     
                                                                 
 max_pooling3d_1 (MaxPooling  (None, 16, 12, 12, 12)   0         
 3D)                                                             
                                                                 
 dropout_1 (Dropout)         (None, 16, 12, 12, 12)    0         
                                                                 
 conv3d_3 (Conv3D)           (None, 32, 10, 10, 10)    13856     
                                                                 
 conv3d_4 (Conv3D)           (None, 64, 8, 8, 8)       55360     
                                                                 
 dropout_2 (Dropout)         (None, 64, 8, 8, 8)       0         
                                                                 
 flatten_1 (Flatten)         (None, 32768)             0         
                                                                 
 dense_1 (Dense)             (None, 128)               4194432   
                                                                 
 dropout_3 (Dropout)         (None, 128)               0         
                                                                 
 dense_2 (Dense)             (None, 1)                 129       
                                                                 
=================================================================
Total params: 4,282,801
Trainable params: 4,282,801
Non-trainable params: 0
_________________________________________________________________

1/1 [==============================] - ETA: 0s
1/1 [==============================] - 1s 636ms/step
Total score for R1117TS029_1.pdb is  18.677177

1/1 [==============================] - ETA: 0s
1/1 [==============================] - 0s 485ms/step
Total score for R1117TS029_2.pdb is  21.76721

1/1 [==============================] - ETA: 0s
1/1 [==============================] - 0s 480ms/step
Total score for R1117TS035_1.pdb is  22.694626

1/1 [==============================] - ETA: 0s
1/1 [==============================] - 1s 504ms/step
Total score for R1117TS035_2.pdb is  21.333931

1/1 [==============================] - ETA: 0s
1/1 [==============================] - 1s 581ms/step
Total score for R1117TS035_3.pdb is  21.777197

1/1 [==============================] - ETA: 0s
1/1 [==============================] - 1s 608ms/step
Total score for R1117TS035_4.pdb is  20.783253

1/1 [==============================] - ETA: 0s
1/1 [==============================] - 1s 603ms/step
Total score for R1117TS035_5.pdb is  21.123133

1/1 [==============================] - ETA: 0s
1/1 [==============================] - 1s 630ms/step
Total score for R1117TS046_1.pdb is  22.694626

1/1 [==============================] - ETA: 0s
1/1 [==============================] - 0s 490ms/step
Total score for R1117TS046_2.pdb is  21.333931

1/1 [==============================] - ETA: 0s
1/1 [==============================] - 0s 482ms/step
Total score for R1117TS046_3.pdb is  21.777197

1/1 [==============================] - ETA: 0s
1/1 [==============================] - 0s 480ms/step
Total score for R1117TS046_4.pdb is  20.783253

1/1 [==============================] - ETA: 0s
1/1 [==============================] - 0s 485ms/step
Total score for R1117TS046_5.pdb is  21.123133

1/1 [==============================] - ETA: 0s
1/1 [==============================] - 0s 484ms/step
Total score for R1117TS054_1.pdb is  18.266336

1/1 [==============================] - ETA: 0s
1/1 [==============================] - 0s 482ms/step
Total score for R1117TS054_2.pdb is  18.365469

1/1 [==============================] - ETA: 0s
1/1 [==============================] - 0s 478ms/step
Total score for R1117TS054_3.pdb is  16.889315

1/1 [==============================] - ETA: 0s
1/1 [==============================] - 1s 603ms/step
Total score for R1117TS054_4.pdb is  16.994692

1/1 [==============================] - ETA: 0s
1/1 [==============================] - 1s 580ms/step
Total score for R1117TS054_5.pdb is  18.961918

1/1 [==============================] - ETA: 0s
1/1 [==============================] - 1s 611ms/step
Total score for R1117TS076_1.pdb is  17.50285

1/1 [==============================] - ETA: 0s
1/1 [==============================] - 1s 610ms/step
Total score for R1117TS076_2.pdb is  17.49292

1/1 [==============================] - ETA: 0s
1/1 [==============================] - 1s 574ms/step
Total score for R1117TS076_3.pdb is  16.93568

1/1 [==============================] - ETA: 0s
1/1 [==============================] - 0s 485ms/step
Total score for R1117TS076_4.pdb is  16.698673

1/1 [==============================] - ETA: 0s
1/1 [==============================] - 0s 482ms/step
Total score for R1117TS076_5.pdb is  17.056955

1/1 [==============================] - ETA: 0s
1/1 [==============================] - 0s 483ms/step
Total score for R1117TS081_1.pdb is  19.06606

1/1 [==============================] - ETA: 0s
1/1 [==============================] - 0s 489ms/step
Total score for R1117TS081_2.pdb is  19.281006

1/1 [==============================] - ETA: 0s
1/1 [==============================] - 0s 484ms/step
Total score for R1117TS081_3.pdb is  20.314919

1/1 [==============================] - ETA: 0s
1/1 [==============================] - 0s 483ms/step
Total score for R1117TS081_4.pdb is  19.86356

1/1 [==============================] - ETA: 0s
1/1 [==============================] - 0s 484ms/step
Total score for R1117TS081_5.pdb is  19.602161

1/1 [==============================] - ETA: 0s
1/1 [==============================] - 1s 532ms/step
Total score for R1117TS091_1.pdb is  23.886862

1/1 [==============================] - ETA: 0s
1/1 [==============================] - 1s 599ms/step
Total score for R1117TS091_2.pdb is  23.707705

1/1 [==============================] - ETA: 0s
1/1 [==============================] - 1s 604ms/step
Total score for R1117TS091_3.pdb is  23.185658

1/1 [==============================] - ETA: 0s
1/1 [==============================] - 1s 596ms/step
Total score for R1117TS091_4.pdb is  23.887087

1/1 [==============================] - ETA: 0s
1/1 [==============================] - 1s 613ms/step
Total score for R1117TS091_5.pdb is  22.164616

1/1 [==============================] - ETA: 0s
1/1 [==============================] - 1s 613ms/step
Total score for R1117TS097_1.pdb is  21.919884

1/1 [==============================] - ETA: 0s
1/1 [==============================] - 0s 483ms/step
Total score for R1117TS110_1.pdb is  18.758312

1/1 [==============================] - ETA: 0s
1/1 [==============================] - 0s 481ms/step
Total score for R1117TS110_2.pdb is  19.007166

1/1 [==============================] - ETA: 0s
1/1 [==============================] - 0s 484ms/step
Total score for R1117TS110_3.pdb is  18.506342

1/1 [==============================] - ETA: 0s
1/1 [==============================] - 0s 482ms/step
Total score for R1117TS110_4.pdb is  18.321644

1/1 [==============================] - ETA: 0s
1/1 [==============================] - 0s 480ms/step
Total score for R1117TS110_5.pdb is  18.364244

1/1 [==============================] - ETA: 0s
1/1 [==============================] - 0s 482ms/step
Total score for R1117TS119_1.pdb is  18.699497

1/1 [==============================] - ETA: 0s
1/1 [==============================] - 0s 499ms/step
Total score for R1117TS119_2.pdb is  18.427242

1/1 [==============================] - ETA: 0s
1/1 [==============================] - 1s 535ms/step
Total score for R1117TS119_3.pdb is  19.56626

1/1 [==============================] - ETA: 0s
1/1 [==============================] - 1s 599ms/step
Total score for R1117TS119_4.pdb is  18.934372

1/1 [==============================] - ETA: 0s
1/1 [==============================] - 1s 623ms/step
Total score for R1117TS119_5.pdb is  17.296711

1/1 [==============================] - ETA: 0s
1/1 [==============================] - 1s 603ms/step
Total score for R1117TS125_1.pdb is  18.540384

1/1 [==============================] - ETA: 0s
1/1 [==============================] - 1s 640ms/step
Total score for R1117TS125_2.pdb is  19.799

1/1 [==============================] - ETA: 0s
1/1 [==============================] - 0s 494ms/step
Total score for R1117TS125_3.pdb is  18.266336

1/1 [==============================] - ETA: 0s
1/1 [==============================] - 0s 481ms/step
Total score for R1117TS125_4.pdb is  19.39151

1/1 [==============================] - ETA: 0s
1/1 [==============================] - 0s 482ms/step
Total score for R1117TS125_5.pdb is  18.679413

1/1 [==============================] - ETA: 0s
1/1 [==============================] - 0s 482ms/step
Total score for R1117TS128_1.pdb is  18.769384

1/1 [==============================] - ETA: 0s
1/1 [==============================] - 0s 479ms/step
Total score for R1117TS128_2.pdb is  17.723806

1/1 [==============================] - ETA: 0s
1/1 [==============================] - 0s 483ms/step
Total score for R1117TS128_3.pdb is  17.906515

1/1 [==============================] - ETA: 0s
1/1 [==============================] - 0s 482ms/step
Total score for R1117TS128_4.pdb is  17.829386

1/1 [==============================] - ETA: 0s
1/1 [==============================] - 1s 602ms/step
Total score for R1117TS128_5.pdb is  18.353138

1/1 [==============================] - ETA: 0s
1/1 [==============================] - 1s 583ms/step
Total score for R1117TS131_1.pdb is  19.56435

1/1 [==============================] - ETA: 0s
1/1 [==============================] - 1s 651ms/step
Total score for R1117TS131_2.pdb is  16.56241

1/1 [==============================] - ETA: 0s
1/1 [==============================] - 1s 599ms/step
Total score for R1117TS131_3.pdb is  16.397

1/1 [==============================] - ETA: 0s
1/1 [==============================] - 1s 625ms/step
Total score for R1117TS131_4.pdb is  20.727106

1/1 [==============================] - ETA: 0s
1/1 [==============================] - 0s 482ms/step
Total score for R1117TS131_5.pdb is  17.787498

1/1 [==============================] - ETA: 0s
1/1 [==============================] - 0s 491ms/step
Total score for R1117TS147_1.pdb is  19.190065

1/1 [==============================] - ETA: 0s
1/1 [==============================] - 0s 480ms/step
Total score for R1117TS147_2.pdb is  18.334646

1/1 [==============================] - ETA: 0s
1/1 [==============================] - 0s 480ms/step
Total score for R1117TS147_3.pdb is  18.519072

1/1 [==============================] - ETA: 0s
1/1 [==============================] - 0s 500ms/step
Total score for R1117TS147_4.pdb is  19.121948

1/1 [==============================] - ETA: 0s
1/1 [==============================] - 0s 483ms/step
Total score for R1117TS147_5.pdb is  18.755503

1/1 [==============================] - ETA: 0s
1/1 [==============================] - 0s 487ms/step
Total score for R1117TS163_1.pdb is  18.686327

1/1 [==============================] - ETA: 0s
1/1 [==============================] - 0s 481ms/step
Total score for R1117TS163_2.pdb is  18.686327

1/1 [==============================] - ETA: 0s
1/1 [==============================] - 1s 596ms/step
Total score for R1117TS163_3.pdb is  18.675106

1/1 [==============================] - ETA: 0s
1/1 [==============================] - 1s 624ms/step
Total score for R1117TS163_4.pdb is  19.765022

1/1 [==============================] - ETA: 0s
1/1 [==============================] - 1s 606ms/step
Total score for R1117TS163_5.pdb is  18.422827

1/1 [==============================] - ETA: 0s
1/1 [==============================] - 1s 629ms/step
Total score for R1117TS177_1.pdb is  15.7998

1/1 [==============================] - ETA: 0s
1/1 [==============================] - 0s 491ms/step
Total score for R1117TS185_1.pdb is  16.758205

1/1 [==============================] - ETA: 0s
1/1 [==============================] - 0s 483ms/step
Total score for R1117TS185_2.pdb is  18.899595

1/1 [==============================] - ETA: 0s
1/1 [==============================] - 0s 474ms/step
Total score for R1117TS185_3.pdb is  19.588226

1/1 [==============================] - ETA: 0s
1/1 [==============================] - 0s 484ms/step
Total score for R1117TS185_4.pdb is  19.527277

1/1 [==============================] - ETA: 0s
1/1 [==============================] - 0s 481ms/step
Total score for R1117TS185_5.pdb is  16.396143

1/1 [==============================] - ETA: 0s
1/1 [==============================] - 0s 481ms/step
Total score for R1117TS227_1.pdb is  18.437256

1/1 [==============================] - ETA: 0s
1/1 [==============================] - 0s 482ms/step
Total score for R1117TS227_2.pdb is  18.11822

1/1 [==============================] - ETA: 0s
1/1 [==============================] - 0s 482ms/step
Total score for R1117TS227_3.pdb is  18.95232

1/1 [==============================] - ETA: 0s
1/1 [==============================] - 1s 626ms/step
Total score for R1117TS227_5.pdb is  18.466051

1/1 [==============================] - ETA: 0s
1/1 [==============================] - 1s 628ms/step
Total score for R1117TS229_1.pdb is  19.07945

1/1 [==============================] - ETA: 0s
1/1 [==============================] - 1s 595ms/step
Total score for R1117TS229_2.pdb is  19.21413

1/1 [==============================] - ETA: 0s
1/1 [==============================] - 1s 632ms/step
Total score for R1117TS229_3.pdb is  17.91031

1/1 [==============================] - ETA: 0s
1/1 [==============================] - 0s 485ms/step
Total score for R1117TS229_4.pdb is  20.312065

1/1 [==============================] - ETA: 0s
1/1 [==============================] - 0s 485ms/step
Total score for R1117TS229_5.pdb is  18.422827

1/1 [==============================] - ETA: 0s
1/1 [==============================] - 0s 480ms/step
Total score for R1117TS232_1.pdb is  17.439823

1/1 [==============================] - ETA: 0s
1/1 [==============================] - 0s 478ms/step
Total score for R1117TS232_2.pdb is  17.753872

1/1 [==============================] - ETA: 0s
1/1 [==============================] - 0s 485ms/step
Total score for R1117TS232_3.pdb is  17.148148

1/1 [==============================] - ETA: 0s
1/1 [==============================] - 0s 483ms/step
Total score for R1117TS232_4.pdb is  18.088236

1/1 [==============================] - ETA: 0s
1/1 [==============================] - 0s 483ms/step
Total score for R1117TS232_5.pdb is  17.374695

1/1 [==============================] - ETA: 0s
1/1 [==============================] - 1s 502ms/step
Total score for R1117TS235_1.pdb is  17.226498

1/1 [==============================] - ETA: 0s
1/1 [==============================] - 1s 598ms/step
Total score for R1117TS235_2.pdb is  18.712791

1/1 [==============================] - ETA: 0s
1/1 [==============================] - 1s 602ms/step
Total score for R1117TS235_3.pdb is  14.657643

1/1 [==============================] - ETA: 0s
1/1 [==============================] - 1s 614ms/step
Total score for R1117TS235_4.pdb is  18.281137

1/1 [==============================] - ETA: 0s
1/1 [==============================] - 1s 607ms/step
Total score for R1117TS235_5.pdb is  16.750946

1/1 [==============================] - ETA: 0s
1/1 [==============================] - 0s 481ms/step
Total score for R1117TS238_1.pdb is  17.74125

1/1 [==============================] - ETA: 0s
1/1 [==============================] - 0s 482ms/step
Total score for R1117TS238_2.pdb is  10.781585

1/1 [==============================] - ETA: 0s
1/1 [==============================] - 0s 483ms/step
Total score for R1117TS239_1.pdb is  19.359365

1/1 [==============================] - ETA: 0s
1/1 [==============================] - 0s 499ms/step
Total score for R1117TS239_2.pdb is  17.91031

1/1 [==============================] - ETA: 0s
1/1 [==============================] - 0s 492ms/step
Total score for R1117TS239_3.pdb is  20.300915

1/1 [==============================] - ETA: 0s
1/1 [==============================] - 0s 480ms/step
Total score for R1117TS239_4.pdb is  20.248394

1/1 [==============================] - ETA: 0s
1/1 [==============================] - 0s 483ms/step
Total score for R1117TS245_1.pdb is  20.080143

1/1 [==============================] - ETA: 0s
1/1 [==============================] - 1s 538ms/step
Total score for R1117TS245_2.pdb is  19.029066

1/1 [==============================] - ETA: 0s
1/1 [==============================] - 1s 579ms/step
Total score for R1117TS245_3.pdb is  18.284204

1/1 [==============================] - ETA: 0s
1/1 [==============================] - 1s 616ms/step
Total score for R1117TS245_4.pdb is  18.430752

1/1 [==============================] - ETA: 0s
1/1 [==============================] - 1s 589ms/step
Total score for R1117TS245_5.pdb is  18.002502

1/1 [==============================] - ETA: 0s
1/1 [==============================] - 1s 618ms/step
Total score for R1117TS248_1.pdb is  19.987095

1/1 [==============================] - ETA: 0s
1/1 [==============================] - 0s 489ms/step
Total score for R1117TS248_2.pdb is  20.012953

1/1 [==============================] - ETA: 0s
1/1 [==============================] - 0s 487ms/step
Total score for R1117TS248_3.pdb is  20.952032

1/1 [==============================] - ETA: 0s
1/1 [==============================] - 0s 482ms/step
Total score for R1117TS248_4.pdb is  20.41909

1/1 [==============================] - ETA: 0s
1/1 [==============================] - 0s 482ms/step
Total score for R1117TS248_5.pdb is  20.275421

1/1 [==============================] - ETA: 0s
1/1 [==============================] - 0s 485ms/step
Total score for R1117TS287_1.pdb is  18.605604

1/1 [==============================] - ETA: 0s
1/1 [==============================] - 0s 483ms/step
Total score for R1117TS287_2.pdb is  18.87099

1/1 [==============================] - ETA: 0s
1/1 [==============================] - 0s 480ms/step
Total score for R1117TS287_3.pdb is  19.180363

1/1 [==============================] - ETA: 0s
1/1 [==============================] - 1s 603ms/step
Total score for R1117TS287_4.pdb is  19.191938

1/1 [==============================] - ETA: 0s
1/1 [==============================] - 1s 612ms/step
Total score for R1117TS287_5.pdb is  18.653027

1/1 [==============================] - ETA: 0s
1/1 [==============================] - 1s 605ms/step
Total score for R1117TS385_1.pdb is  20.080143

1/1 [==============================] - ETA: 0s
1/1 [==============================] - 1s 599ms/step
Total score for R1117TS385_2.pdb is  19.029066

1/1 [==============================] - ETA: 0s
1/1 [==============================] - 1s 613ms/step
Total score for R1117TS385_3.pdb is  18.284204

1/1 [==============================] - ETA: 0s
1/1 [==============================] - 0s 482ms/step
Total score for R1117TS385_4.pdb is  18.430752

1/1 [==============================] - ETA: 0s
1/1 [==============================] - 0s 487ms/step
Total score for R1117TS385_5.pdb is  18.002502

1/1 [==============================] - ETA: 0s
1/1 [==============================] - 0s 483ms/step
Total score for R1117TS392_1.pdb is  19.84728

1/1 [==============================] - ETA: 0s
1/1 [==============================] - 0s 499ms/step
Total score for R1117TS392_2.pdb is  20.575182

1/1 [==============================] - ETA: 0s
1/1 [==============================] - 0s 480ms/step
Total score for R1117TS392_3.pdb is  18.519129

1/1 [==============================] - ETA: 0s
1/1 [==============================] - 0s 484ms/step
Total score for R1117TS392_4.pdb is  16.925608

1/1 [==============================] - ETA: 0s
1/1 [==============================] - 0s 485ms/step
Total score for R1117TS392_5.pdb is  17.257996

1/1 [==============================] - ETA: 0s
1/1 [==============================] - 1s 534ms/step
Total score for R1117TS416_1.pdb is  16.737688

1/1 [==============================] - ETA: 0s
1/1 [==============================] - 1s 602ms/step
Total score for R1117TS416_2.pdb is  18.85858

1/1 [==============================] - ETA: 0s
1/1 [==============================] - 1s 622ms/step
Total score for R1117TS416_3.pdb is  18.176937

1/1 [==============================] - ETA: 0s
1/1 [==============================] - 1s 598ms/step
Total score for R1117TS416_4.pdb is  17.890905

1/1 [==============================] - ETA: 0s
1/1 [==============================] - 1s 616ms/step
Total score for R1117TS416_5.pdb is  17.060286

1/1 [==============================] - ETA: 0s
1/1 [==============================] - 0s 483ms/step
Total score for R1117TS434_1.pdb is  18.810625

1/1 [==============================] - ETA: 0s
1/1 [==============================] - 0s 480ms/step
Total score for R1117TS434_2.pdb is  18.407566

1/1 [==============================] - ETA: 0s
1/1 [==============================] - 0s 480ms/step
Total score for R1117TS434_3.pdb is  17.77721

1/1 [==============================] - ETA: 0s
1/1 [==============================] - 0s 487ms/step
Total score for R1117TS434_4.pdb is  18.437256

1/1 [==============================] - ETA: 0s
1/1 [==============================] - 0s 486ms/step
Total score for R1117TS439_1.pdb is  18.236769

1/1 [==============================] - ETA: 0s
1/1 [==============================] - 0s 486ms/step
Total score for R1117TS439_2.pdb is  18.073872

1/1 [==============================] - ETA: 0s
1/1 [==============================] - 0s 480ms/step
Total score for R1117TS439_3.pdb is  18.696198

1/1 [==============================] - ETA: 0s
1/1 [==============================] - 1s 515ms/step
Total score for R1117TS439_4.pdb is  20.914501

1/1 [==============================] - ETA: 0s
1/1 [==============================] - 1s 584ms/step
Total score for R1117TS439_5.pdb is  19.359365

1/1 [==============================] - ETA: 0s
1/1 [==============================] - 1s 608ms/step
Total score for R1117TS444_1.pdb is  19.359365

1/1 [==============================] - ETA: 0s
1/1 [==============================] - 1s 625ms/step
Total score for R1117TS444_2.pdb is  19.21413

1/1 [==============================] - ETA: 0s
1/1 [==============================] - 1s 580ms/step
Total score for R1117TS444_3.pdb is  19.799

1/1 [==============================] - ETA: 0s
1/1 [==============================] - 0s 479ms/step
Total score for R1117TS444_4.pdb is  18.76721

1/1 [==============================] - ETA: 0s
1/1 [==============================] - 1s 508ms/step
Total score for R1117TS444_5.pdb is  20.300915

1/1 [==============================] - ETA: 0s
1/1 [==============================] - 0s 482ms/step
Total score for R1117TS470_1.pdb is  18.570698

1/1 [==============================] - ETA: 0s
1/1 [==============================] - 0s 490ms/step
Total score for R1117TS470_2.pdb is  18.072575

1/1 [==============================] - ETA: 0s
1/1 [==============================] - 0s 482ms/step
Total score for R1117TS470_3.pdb is  18.76721

1/1 [==============================] - ETA: 0s
1/1 [==============================] - 0s 480ms/step
Total score for R1117TS470_4.pdb is  18.76721

1/1 [==============================] - ETA: 0s
1/1 [==============================] - 0s 484ms/step
Total score for R1117TS470_5.pdb is  19.000313

1/1 [==============================] - ETA: 0s
1/1 [==============================] - 1s 588ms/step
Total score for R1117TS489_1.pdb is  18.570698

1/1 [==============================] - ETA: 0s
1/1 [==============================] - 1s 577ms/step
Total score for R1117TS489_2.pdb is  18.072575

1/1 [==============================] - ETA: 0s
1/1 [==============================] - 1s 610ms/step
Total score for R1117TS489_3.pdb is  18.76721

1/1 [==============================] - ETA: 0s
1/1 [==============================] - 1s 613ms/step
Total score for R1117TS489_4.pdb is  18.76721

1/1 [==============================] - ETA: 0s
1/1 [==============================] - 1s 530ms/step
Total score for R1117TS489_5.pdb is  19.000313
