Model: "sequential"
_________________________________________________________________
 Layer (type)                Output Shape              Param #   
=================================================================
 conv3d_1 (Conv3D)           (None, 8, 28, 28, 28)     3008      
                                                                 
 conv3d_2 (Conv3D)           (None, 16, 24, 24, 24)    16016     
                                                                 
 max_pooling3d_1 (MaxPooling  (None, 16, 12, 12, 12)   0         
 3D)                                                             
                                                                 
 dropout_1 (Dropout)         (None, 16, 12, 12, 12)    0         
                                                                 
 conv3d_3 (Conv3D)           (None, 32, 10, 10, 10)    13856     
                                                                 
 conv3d_4 (Conv3D)           (None, 64, 8, 8, 8)       55360     
                                                                 
 dropout_2 (Dropout)         (None, 64, 8, 8, 8)       0         
                                                                 
 flatten_1 (Flatten)         (None, 32768)             0         
                                                                 
 dense_1 (Dense)             (None, 128)               4194432   
                                                                 
 dropout_3 (Dropout)         (None, 128)               0         
                                                                 
 dense_2 (Dense)             (None, 1)                 129       
                                                                 
=================================================================
Total params: 4,282,801
Trainable params: 4,282,801
Non-trainable params: 0
_________________________________________________________________

1/1 [==============================] - ETA: 0s
1/1 [==============================] - 1s 748ms/step
Total score for R1117TS029_1.pdb is  21.155695

1/1 [==============================] - ETA: 0s
1/1 [==============================] - 1s 627ms/step
Total score for R1117TS029_2.pdb is  22.11443

1/1 [==============================] - ETA: 0s
1/1 [==============================] - 0s 460ms/step
Total score for R1117TS035_1.pdb is  23.606403

1/1 [==============================] - ETA: 0s
1/1 [==============================] - 0s 456ms/step
Total score for R1117TS035_2.pdb is  23.00811

1/1 [==============================] - ETA: 0s
1/1 [==============================] - 0s 469ms/step
Total score for R1117TS035_3.pdb is  23.019592

1/1 [==============================] - ETA: 0s
1/1 [==============================] - 0s 460ms/step
Total score for R1117TS035_4.pdb is  23.102682

1/1 [==============================] - ETA: 0s
1/1 [==============================] - 0s 456ms/step
Total score for R1117TS035_5.pdb is  23.188438

1/1 [==============================] - ETA: 0s
1/1 [==============================] - 0s 455ms/step
Total score for R1117TS046_1.pdb is  23.606403

1/1 [==============================] - ETA: 0s
1/1 [==============================] - 0s 462ms/step
Total score for R1117TS046_2.pdb is  23.00811

1/1 [==============================] - ETA: 0s
1/1 [==============================] - 0s 462ms/step
Total score for R1117TS046_3.pdb is  23.019592

1/1 [==============================] - ETA: 0s
1/1 [==============================] - 1s 605ms/step
Total score for R1117TS046_4.pdb is  23.102682

1/1 [==============================] - ETA: 0s
1/1 [==============================] - 1s 597ms/step
Total score for R1117TS046_5.pdb is  23.188438

1/1 [==============================] - ETA: 0s
1/1 [==============================] - 1s 608ms/step
Total score for R1117TS054_1.pdb is  21.22859

1/1 [==============================] - ETA: 0s
1/1 [==============================] - 1s 603ms/step
Total score for R1117TS054_2.pdb is  21.685946

1/1 [==============================] - ETA: 0s
1/1 [==============================] - 0s 460ms/step
Total score for R1117TS054_3.pdb is  20.093584

1/1 [==============================] - ETA: 0s
1/1 [==============================] - 0s 471ms/step
Total score for R1117TS054_4.pdb is  23.073578

1/1 [==============================] - ETA: 0s
1/1 [==============================] - 0s 459ms/step
Total score for R1117TS054_5.pdb is  23.293413

1/1 [==============================] - ETA: 0s
1/1 [==============================] - 0s 463ms/step
Total score for R1117TS076_1.pdb is  19.693863

1/1 [==============================] - ETA: 0s
1/1 [==============================] - 0s 459ms/step
Total score for R1117TS076_2.pdb is  19.78499

1/1 [==============================] - ETA: 0s
1/1 [==============================] - 0s 464ms/step
Total score for R1117TS076_3.pdb is  19.349192

1/1 [==============================] - ETA: 0s
1/1 [==============================] - 0s 463ms/step
Total score for R1117TS076_4.pdb is  19.884743

1/1 [==============================] - ETA: 0s
1/1 [==============================] - 0s 464ms/step
Total score for R1117TS076_5.pdb is  20.454725

1/1 [==============================] - ETA: 0s
1/1 [==============================] - 1s 600ms/step
Total score for R1117TS081_1.pdb is  23.156506

1/1 [==============================] - ETA: 0s
1/1 [==============================] - 1s 603ms/step
Total score for R1117TS081_2.pdb is  22.900719

1/1 [==============================] - ETA: 0s
1/1 [==============================] - 1s 591ms/step
Total score for R1117TS081_3.pdb is  23.26456

1/1 [==============================] - ETA: 0s
1/1 [==============================] - 1s 596ms/step
Total score for R1117TS081_4.pdb is  22.97471

1/1 [==============================] - ETA: 0s
1/1 [==============================] - 0s 459ms/step
Total score for R1117TS081_5.pdb is  22.911617

1/1 [==============================] - ETA: 0s
1/1 [==============================] - 0s 472ms/step
Total score for R1117TS091_1.pdb is  23.09282

1/1 [==============================] - ETA: 0s
1/1 [==============================] - 0s 457ms/step
Total score for R1117TS091_2.pdb is  22.94978

1/1 [==============================] - ETA: 0s
1/1 [==============================] - 0s 458ms/step
Total score for R1117TS091_3.pdb is  23.216743

1/1 [==============================] - ETA: 0s
1/1 [==============================] - 0s 459ms/step
Total score for R1117TS091_4.pdb is  23.568756

1/1 [==============================] - ETA: 0s
1/1 [==============================] - 0s 477ms/step
Total score for R1117TS091_5.pdb is  22.740147

1/1 [==============================] - ETA: 0s
1/1 [==============================] - 0s 458ms/step
Total score for R1117TS097_1.pdb is  22.638216

1/1 [==============================] - ETA: 0s
1/1 [==============================] - 0s 462ms/step
Total score for R1117TS110_1.pdb is  23.236702

1/1 [==============================] - ETA: 0s
1/1 [==============================] - 0s 459ms/step
Total score for R1117TS110_2.pdb is  23.320284

1/1 [==============================] - ETA: 0s
1/1 [==============================] - 1s 602ms/step
Total score for R1117TS110_3.pdb is  23.601095

1/1 [==============================] - ETA: 0s
1/1 [==============================] - 1s 598ms/step
Total score for R1117TS110_4.pdb is  23.140884

1/1 [==============================] - ETA: 0s
1/1 [==============================] - 1s 604ms/step
Total score for R1117TS110_5.pdb is  23.106236

1/1 [==============================] - ETA: 0s
1/1 [==============================] - 1s 584ms/step
Total score for R1117TS119_1.pdb is  21.51649

1/1 [==============================] - ETA: 0s
1/1 [==============================] - 1s 549ms/step
Total score for R1117TS119_2.pdb is  20.758442

1/1 [==============================] - ETA: 0s
1/1 [==============================] - 0s 457ms/step
Total score for R1117TS119_3.pdb is  21.170954

1/1 [==============================] - ETA: 0s
1/1 [==============================] - 0s 460ms/step
Total score for R1117TS119_4.pdb is  21.993902

1/1 [==============================] - ETA: 0s
1/1 [==============================] - 0s 461ms/step
Total score for R1117TS119_5.pdb is  20.94583

1/1 [==============================] - ETA: 0s
1/1 [==============================] - 0s 461ms/step
Total score for R1117TS125_1.pdb is  21.274803

1/1 [==============================] - ETA: 0s
1/1 [==============================] - 0s 459ms/step
Total score for R1117TS125_2.pdb is  21.555931

1/1 [==============================] - ETA: 0s
1/1 [==============================] - 0s 453ms/step
Total score for R1117TS125_3.pdb is  21.22859

1/1 [==============================] - ETA: 0s
1/1 [==============================] - 0s 456ms/step
Total score for R1117TS125_4.pdb is  21.7598

1/1 [==============================] - ETA: 0s
1/1 [==============================] - 1s 524ms/step
Total score for R1117TS125_5.pdb is  20.2561

1/1 [==============================] - ETA: 0s
1/1 [==============================] - 1s 564ms/step
Total score for R1117TS128_1.pdb is  21.300798

1/1 [==============================] - ETA: 0s
1/1 [==============================] - 1s 605ms/step
Total score for R1117TS128_2.pdb is  21.08186

1/1 [==============================] - ETA: 0s
1/1 [==============================] - 1s 571ms/step
Total score for R1117TS128_3.pdb is  20.64467

1/1 [==============================] - ETA: 0s
1/1 [==============================] - 1s 567ms/step
Total score for R1117TS128_4.pdb is  21.199854

1/1 [==============================] - ETA: 0s
1/1 [==============================] - 0s 460ms/step
Total score for R1117TS128_5.pdb is  21.896225

1/1 [==============================] - ETA: 0s
1/1 [==============================] - 1s 521ms/step
Total score for R1117TS131_1.pdb is  22.367735

1/1 [==============================] - ETA: 0s
1/1 [==============================] - 0s 463ms/step
Total score for R1117TS131_2.pdb is  23.216234

1/1 [==============================] - ETA: 0s
1/1 [==============================] - 0s 464ms/step
Total score for R1117TS131_3.pdb is  22.86821

1/1 [==============================] - ETA: 0s
1/1 [==============================] - 0s 460ms/step
Total score for R1117TS131_4.pdb is  23.051525

1/1 [==============================] - ETA: 0s
1/1 [==============================] - 0s 456ms/step
Total score for R1117TS131_5.pdb is  22.478336

1/1 [==============================] - ETA: 0s
1/1 [==============================] - 0s 462ms/step
Total score for R1117TS147_1.pdb is  21.388826

1/1 [==============================] - ETA: 0s
1/1 [==============================] - 0s 486ms/step
Total score for R1117TS147_2.pdb is  20.62744

1/1 [==============================] - ETA: 0s
1/1 [==============================] - 1s 596ms/step
Total score for R1117TS147_3.pdb is  20.391172

1/1 [==============================] - ETA: 0s
1/1 [==============================] - 1s 623ms/step
Total score for R1117TS147_4.pdb is  22.071953

1/1 [==============================] - ETA: 0s
1/1 [==============================] - 1s 585ms/step
Total score for R1117TS147_5.pdb is  19.88378

1/1 [==============================] - ETA: 0s
1/1 [==============================] - 1s 631ms/step
Total score for R1117TS163_1.pdb is  22.147865

1/1 [==============================] - ETA: 0s
1/1 [==============================] - 0s 459ms/step
Total score for R1117TS163_2.pdb is  22.147865

1/1 [==============================] - ETA: 0s
1/1 [==============================] - 0s 456ms/step
Total score for R1117TS163_3.pdb is  21.967228

1/1 [==============================] - ETA: 0s
1/1 [==============================] - 0s 462ms/step
Total score for R1117TS163_4.pdb is  22.356773

1/1 [==============================] - ETA: 0s
1/1 [==============================] - 0s 461ms/step
Total score for R1117TS163_5.pdb is  20.14569

1/1 [==============================] - ETA: 0s
1/1 [==============================] - 0s 461ms/step
Total score for R1117TS177_1.pdb is  23.431868

1/1 [==============================] - ETA: 0s
1/1 [==============================] - 0s 456ms/step
Total score for R1117TS185_1.pdb is  21.842575

1/1 [==============================] - ETA: 0s
1/1 [==============================] - 0s 460ms/step
Total score for R1117TS185_2.pdb is  22.557167

1/1 [==============================] - ETA: 0s
1/1 [==============================] - 0s 459ms/step
Total score for R1117TS185_3.pdb is  23.096493

1/1 [==============================] - ETA: 0s
1/1 [==============================] - 1s 584ms/step
Total score for R1117TS185_4.pdb is  22.990358

1/1 [==============================] - ETA: 0s
1/1 [==============================] - 1s 600ms/step
Total score for R1117TS185_5.pdb is  20.42646

1/1 [==============================] - ETA: 0s
1/1 [==============================] - 1s 582ms/step
Total score for R1117TS227_1.pdb is  20.76151

1/1 [==============================] - ETA: 0s
1/1 [==============================] - 1s 568ms/step
Total score for R1117TS227_2.pdb is  20.548113

1/1 [==============================] - ETA: 0s
1/1 [==============================] - 1s 540ms/step
Total score for R1117TS227_3.pdb is  21.68029

1/1 [==============================] - ETA: 0s
1/1 [==============================] - 0s 460ms/step
Total score for R1117TS227_5.pdb is  20.85588

1/1 [==============================] - ETA: 0s
1/1 [==============================] - 0s 462ms/step
Total score for R1117TS229_1.pdb is  21.620783

1/1 [==============================] - ETA: 0s
1/1 [==============================] - 0s 464ms/step
Total score for R1117TS229_2.pdb is  21.959715

1/1 [==============================] - ETA: 0s
1/1 [==============================] - 0s 458ms/step
Total score for R1117TS229_3.pdb is  21.629099

1/1 [==============================] - ETA: 0s
1/1 [==============================] - 0s 459ms/step
Total score for R1117TS229_4.pdb is  22.615639

1/1 [==============================] - ETA: 0s
1/1 [==============================] - 0s 483ms/step
Total score for R1117TS229_5.pdb is  20.14569

1/1 [==============================] - ETA: 0s
1/1 [==============================] - 0s 455ms/step
Total score for R1117TS232_1.pdb is  21.43918

1/1 [==============================] - ETA: 0s
1/1 [==============================] - 1s 585ms/step
Total score for R1117TS232_2.pdb is  21.410158

1/1 [==============================] - ETA: 0s
1/1 [==============================] - 1s 560ms/step
Total score for R1117TS232_3.pdb is  21.26826

1/1 [==============================] - ETA: 0s
1/1 [==============================] - 1s 621ms/step
Total score for R1117TS232_4.pdb is  22.129606

1/1 [==============================] - ETA: 0s
1/1 [==============================] - 1s 580ms/step
Total score for R1117TS232_5.pdb is  21.441769

1/1 [==============================] - ETA: 0s
1/1 [==============================] - 0s 455ms/step
Total score for R1117TS235_1.pdb is  21.38063

1/1 [==============================] - ETA: 0s
1/1 [==============================] - 0s 457ms/step
Total score for R1117TS235_2.pdb is  21.178873

1/1 [==============================] - ETA: 0s
1/1 [==============================] - 0s 459ms/step
Total score for R1117TS235_3.pdb is  23.633823

1/1 [==============================] - ETA: 0s
1/1 [==============================] - 0s 456ms/step
Total score for R1117TS235_4.pdb is  21.779196

1/1 [==============================] - ETA: 0s
1/1 [==============================] - 0s 458ms/step
Total score for R1117TS235_5.pdb is  20.488777

1/1 [==============================] - ETA: 0s
1/1 [==============================] - 0s 459ms/step
Total score for R1117TS238_1.pdb is  25.13278

1/1 [==============================] - ETA: 0s
1/1 [==============================] - 0s 464ms/step
Total score for R1117TS238_2.pdb is  26.923166

1/1 [==============================] - ETA: 0s
1/1 [==============================] - 0s 496ms/step
Total score for R1117TS239_1.pdb is  22.455702

1/1 [==============================] - ETA: 0s
1/1 [==============================] - 1s 582ms/step
Total score for R1117TS239_2.pdb is  21.629099

1/1 [==============================] - ETA: 0s
1/1 [==============================] - 1s 607ms/step
Total score for R1117TS239_3.pdb is  22.187092

1/1 [==============================] - ETA: 0s
1/1 [==============================] - 1s 570ms/step
Total score for R1117TS239_4.pdb is  21.81511

1/1 [==============================] - ETA: 0s
1/1 [==============================] - 1s 621ms/step
Total score for R1117TS245_1.pdb is  20.990805

1/1 [==============================] - ETA: 0s
1/1 [==============================] - 0s 457ms/step
Total score for R1117TS245_2.pdb is  19.68962

1/1 [==============================] - ETA: 0s
1/1 [==============================] - 0s 458ms/step
Total score for R1117TS245_3.pdb is  20.17668

1/1 [==============================] - ETA: 0s
1/1 [==============================] - 0s 461ms/step
Total score for R1117TS245_4.pdb is  20.726507

1/1 [==============================] - ETA: 0s
1/1 [==============================] - 0s 457ms/step
Total score for R1117TS245_5.pdb is  19.109148

1/1 [==============================] - ETA: 0s
1/1 [==============================] - 0s 466ms/step
Total score for R1117TS248_1.pdb is  22.104822

1/1 [==============================] - ETA: 0s
1/1 [==============================] - 0s 463ms/step
Total score for R1117TS248_2.pdb is  22.15641

1/1 [==============================] - ETA: 0s
1/1 [==============================] - 0s 459ms/step
Total score for R1117TS248_3.pdb is  21.842857

1/1 [==============================] - ETA: 0s
1/1 [==============================] - 0s 453ms/step
Total score for R1117TS248_4.pdb is  22.211391

1/1 [==============================] - ETA: 0s
1/1 [==============================] - 1s 590ms/step
Total score for R1117TS248_5.pdb is  21.636642

1/1 [==============================] - ETA: 0s
1/1 [==============================] - 1s 585ms/step
Total score for R1117TS287_1.pdb is  20.564228

1/1 [==============================] - ETA: 0s
1/1 [==============================] - 1s 568ms/step
Total score for R1117TS287_2.pdb is  20.525288

1/1 [==============================] - ETA: 0s
1/1 [==============================] - 1s 613ms/step
Total score for R1117TS287_3.pdb is  21.00997

1/1 [==============================] - ETA: 0s
1/1 [==============================] - 0s 460ms/step
Total score for R1117TS287_4.pdb is  20.660843

1/1 [==============================] - ETA: 0s
1/1 [==============================] - 0s 466ms/step
Total score for R1117TS287_5.pdb is  20.468735

1/1 [==============================] - ETA: 0s
1/1 [==============================] - 0s 459ms/step
Total score for R1117TS385_1.pdb is  20.990805

1/1 [==============================] - ETA: 0s
1/1 [==============================] - 0s 456ms/step
Total score for R1117TS385_2.pdb is  19.68962

1/1 [==============================] - ETA: 0s
1/1 [==============================] - 0s 459ms/step
Total score for R1117TS385_3.pdb is  20.17668

1/1 [==============================] - ETA: 0s
1/1 [==============================] - 0s 464ms/step
Total score for R1117TS385_4.pdb is  20.726507

1/1 [==============================] - ETA: 0s
1/1 [==============================] - 0s 460ms/step
Total score for R1117TS385_5.pdb is  19.109148

1/1 [==============================] - ETA: 0s
1/1 [==============================] - 0s 460ms/step
Total score for R1117TS392_1.pdb is  21.549366

1/1 [==============================] - ETA: 0s
1/1 [==============================] - 1s 529ms/step
Total score for R1117TS392_2.pdb is  22.851906

1/1 [==============================] - ETA: 0s
1/1 [==============================] - 1s 568ms/step
Total score for R1117TS392_3.pdb is  21.993582

1/1 [==============================] - ETA: 0s
1/1 [==============================] - 1s 608ms/step
Total score for R1117TS392_4.pdb is  21.214777

1/1 [==============================] - ETA: 0s
1/1 [==============================] - 1s 574ms/step
Total score for R1117TS392_5.pdb is  21.714314

1/1 [==============================] - ETA: 0s
1/1 [==============================] - 1s 583ms/step
Total score for R1117TS416_1.pdb is  20.660086

1/1 [==============================] - ETA: 0s
1/1 [==============================] - 0s 461ms/step
Total score for R1117TS416_2.pdb is  23.081821

1/1 [==============================] - ETA: 0s
1/1 [==============================] - 0s 458ms/step
Total score for R1117TS416_3.pdb is  21.949738

1/1 [==============================] - ETA: 0s
1/1 [==============================] - 0s 475ms/step
Total score for R1117TS416_4.pdb is  21.561533

1/1 [==============================] - ETA: 0s
1/1 [==============================] - 0s 463ms/step
Total score for R1117TS416_5.pdb is  20.951855

1/1 [==============================] - ETA: 0s
1/1 [==============================] - 0s 458ms/step
Total score for R1117TS434_1.pdb is  20.6512

1/1 [==============================] - ETA: 0s
1/1 [==============================] - 0s 457ms/step
Total score for R1117TS434_2.pdb is  19.961658

1/1 [==============================] - ETA: 0s
1/1 [==============================] - 0s 467ms/step
Total score for R1117TS434_3.pdb is  19.88989

1/1 [==============================] - ETA: 0s
1/1 [==============================] - 0s 472ms/step
Total score for R1117TS434_4.pdb is  20.76151

1/1 [==============================] - ETA: 0s
1/1 [==============================] - 1s 574ms/step
Total score for R1117TS439_1.pdb is  22.552084

1/1 [==============================] - ETA: 0s
1/1 [==============================] - 1s 594ms/step
Total score for R1117TS439_2.pdb is  22.209333

1/1 [==============================] - ETA: 0s
1/1 [==============================] - 1s 572ms/step
Total score for R1117TS439_3.pdb is  22.860004

1/1 [==============================] - ETA: 0s
1/1 [==============================] - 1s 584ms/step
Total score for R1117TS439_4.pdb is  23.77568

1/1 [==============================] - ETA: 0s
1/1 [==============================] - 0s 459ms/step
Total score for R1117TS439_5.pdb is  22.455702

1/1 [==============================] - ETA: 0s
1/1 [==============================] - 0s 464ms/step
Total score for R1117TS444_1.pdb is  22.455702

1/1 [==============================] - ETA: 0s
1/1 [==============================] - 0s 458ms/step
Total score for R1117TS444_2.pdb is  21.959715

1/1 [==============================] - ETA: 0s
1/1 [==============================] - 0s 455ms/step
Total score for R1117TS444_3.pdb is  21.555931

1/1 [==============================] - ETA: 0s
1/1 [==============================] - 0s 460ms/step
Total score for R1117TS444_4.pdb is  21.09979

1/1 [==============================] - ETA: 0s
1/1 [==============================] - 0s 474ms/step
Total score for R1117TS444_5.pdb is  22.187092

1/1 [==============================] - ETA: 0s
1/1 [==============================] - 0s 457ms/step
Total score for R1117TS470_1.pdb is  23.904566

1/1 [==============================] - ETA: 0s
1/1 [==============================] - 1s 517ms/step
Total score for R1117TS470_2.pdb is  23.15851

1/1 [==============================] - ETA: 0s
1/1 [==============================] - 1s 599ms/step
Total score for R1117TS470_3.pdb is  21.09979

1/1 [==============================] - ETA: 0s
1/1 [==============================] - 1s 583ms/step
Total score for R1117TS470_4.pdb is  21.09979

1/1 [==============================] - ETA: 0s
1/1 [==============================] - 1s 577ms/step
Total score for R1117TS470_5.pdb is  21.9784

1/1 [==============================] - ETA: 0s
1/1 [==============================] - 1s 595ms/step
Total score for R1117TS489_1.pdb is  23.904566

1/1 [==============================] - ETA: 0s
1/1 [==============================] - 0s 458ms/step
Total score for R1117TS489_2.pdb is  23.15851

1/1 [==============================] - ETA: 0s
1/1 [==============================] - 0s 461ms/step
Total score for R1117TS489_3.pdb is  21.09979

1/1 [==============================] - ETA: 0s
1/1 [==============================] - 0s 463ms/step
Total score for R1117TS489_4.pdb is  21.09979

1/1 [==============================] - ETA: 0s
1/1 [==============================] - 0s 458ms/step
Total score for R1117TS489_5.pdb is  21.9784
